/*
 Реализовать базу данных ГАИ по штрафным квитанциям с помощью бинарного дерева.
 Ключом будет служить номер автомашины, значением узла — список(массив) правонарушений, с пометкой оплачено или не оплачено для каждого правонарушения.
 Если квитанция добавляется в первый раз, то в дереве появляется новый узел, а в списке данные по правонарушению; если нет, то данные заносятся в существующий список. Необходимо также реализовать следующие операции:
 • Полная распечатка базы данных (по номерам машин и списку правонарушений, числящихся за ними);
 • Распечатка данных по заданному номеру;
 • Распечатка данных по диапазону номеров.
 */


#ifndef Header_h
#define Header_h

#include <iostream>
#include <string>
using namespace std;

#endif
